;;---------------------------------------------------------------------------------------
;; FILE: XComGame Loco file for More Amps。uc
;;
;; File by RustyDios by 冬景瞳
;;
;; File created 07/09/20 17:00
;; LAST UPDATED 01/01/23 16:15
;;
;;---------------------------------------------------------------------------------------

[OneMorePsiAmp_CV X2WeaponTemplate]
FriendlyName="耗尽灵能植入物"
FriendlyNamePlural="耗尽灵能植入物"
BriefSummary="灵能植入物可以让灵能特工施展他们的灵能。更高级的灵能植入物可以增加特工的心灵力量和他们能力的有效性。"
TacticalText="<Bullet/> 灵能植入物可以让灵能特工施展他们的灵能。\n<Bullet/> 更高级的灵能植入物可以增加特工的心灵力量和他们能力效果。"
AbilityDescName="灵能植入物"

[OneMorePsiAmp_MG X2WeaponTemplate]
FriendlyName="变种人灵能植入物"
FriendlyNamePlural="变种人灵能植入物"
BriefSummary="这个进化版的灵能植入物能更清晰地引导使用者的灵能，使我们的特工拥有更强的灵能力量。使用此植入物后，某些技能的心灵攻击和心灵攻击伤害得到提高。"
TacticalText="<Bullet/> 变种人灵感应植入物使灵感应特工的灵能强度提高+20。\n<Bullet/> Psi值决定了你的灵能强度。\n<Bullet/> 变种人Psi 植入物还会增加许多灵能攻击造成的伤害。"
AbilityDescName="灵能植入物"

[OneMorePsiAmp_BM X2WeaponTemplate]
FriendlyName="超铀灵能植入物"
FriendlyNamePlural="超铀灵能植入物"
BriefSummary="这个版本的灵能植入物包含了我们遇到的强大的“守门人”外星人的文物。它会让我们经验丰富的Psi特工和外星人最强大的灵能力量处于同一水平。"
TacticalText="<Bullet/> 灵能植入物使灵能特工的灵能强度提高40点。\n<Bullet/> Psi值决定了你的灵能强度 abilities。<Bullet/> 超铀Psi 植入物还会增加许多灵能攻击造成的伤害。"
AbilityDescName="灵能植入物"

[PsiAmp_MG_Schematic X2SchematicTemplate]
m_strClassLabel="灵能"
[PsiAmp_BM_Schematic X2SchematicTemplate]
m_strClassLabel="灵能"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; MOD支持-可玩外星人
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[SectoidAmp_CV X2WeaponTemplate]
FriendlyName="耗尽灰人植入物"
FriendlyNamePlural="耗尽灰人植入物"
BriefSummary="虽然灰人通过引入人类DNA而增加了心灵力量，但他们现在需要为他们设计的心灵植入物来有效地控制他们的力量。"
TacticalText="<Bullet/> 虽然灰人通过引入人类DNA而增加了心灵力量，但他们现在需要为他们设计的心灵植入物来有效地控制他们的力量。"
AbilityDescName="灰人植入物"

[SectoidAmp_MG X2WeaponTemplate]
FriendlyName="变种人灰人植入物"
FriendlyNamePlural="ectoid植入物"
BriefSummary="虽然灰人通过引入人类DNA而增加了心灵力量，但他们现在需要为他们设计的心灵植入物来有效地控制他们的力量。"
TacticalText="<Bullet/> 虽然灰人通过引入人类DNA而增加了心灵力量，但他们现在需要为他们设计的心灵植入物来有效地控制他们的力量。"
AbilityDescName="灰人植入物"

[SectoidAmp_BM X2WeaponTemplate]
FriendlyName="超铀灰人植入物"
FriendlyNamePlural="强力灰人植入物"
BriefSummary="虽然灰人通过引入人类DNA而增加了心灵力量，但他们现在需要为他们设计的心灵植入物来有效地控制他们的力量。"
TacticalText="<Bullet/> 虽然灰人通过引入人类DNA而增加了心灵力量，但他们现在需要为他们设计的心灵植入物来有效地控制他们的力量。"
AbilityDescName="灰人植入物"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; MOD支持-生物类
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[RM_BioAmp_CV X2WeaponTemplate]
FriendlyName="耗尽生物植入物"
FriendlyNamePlural="生物植入物"
BriefSummary="生物植入物可以让生物体发挥他们的生物能力。\n<Bullet/> 更高级的生物植入物可以增加生物的心灵力量和他们能力的有效性。"
TacticalText="<Bullet/> 生物植入物可以让生物体发挥他们的生物能力。\n<Bullet/> 更高级的生物植入物可以增加生物的心灵力量和他们能力的有效性。"

[RM_BioAmp_MG X2WeaponTemplate]
FriendlyName="变种人生物植入物"
FriendlyNamePlural="变种人生物植入物"
BriefSummary="进化版的生物植入物能更清楚地引导使用者的暗能量，让我们的特工拥有更强的生物力量。使用此植入物后，某些技能的Psi攻击和生物攻击伤害得到提高。"
TacticalText="<Bullet/> 降临生物植入物使生物的灵能强度提高+20。\n<Bullet/> Psi值决定了你某些生物能力的效力。\n<Bullet/> 变种人生物植入也增加许多生物攻击造成的伤害。"

[RM_BioAmp_BM X2WeaponTemplate]
FriendlyName="超铀生物植入物"
FriendlyNamePlural="超铀生物植入物"
BriefSummary="这个版本的生物植入物结合了外星元素氦-117，以及来自我们遇到的强大的“守门人”外星人的技术。它能让我们的生物与外星人最强大的灵能力量竞争。"
TacticalText="<Bullet/> 生物精华植入物使生物的灵能强度提高+40。\n<Bullet/> Psi值决定了你某些生物能力的效力。<Bullet/> 超铀生物植入物也增加了许多生物攻击造成的伤害。"

[RM_BioAmp_MG_Schematic X2SchematicTemplate]
m_strClassLabel="仿生学"
[RM_BioAmp_BM_Schematic X2SchematicTemplate]
m_strClassLabel="仿生学"
